In [5]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
'key': ['A', 'B', 'C'],
'value1': [1, 2, 3]
})

df2 = pd.DataFrame({
'key': ['A', 'B', 'D'],
'value2': [4, 5, 6]
})

In [3]:
df3 = pd.merge(df1, df2, on='key', how='inner')

In [4]:
df3

  key  value1  value2
0   A       1       4
1   B       2       5

In [5]:
df_outer = pd.merge(df1, df2, on='key', how='outer')
df_outer

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [6]:
df1 = pd.DataFrame({
'A': ['foo', 'bar'],
'B': [1, 2]
})

df2 = pd.DataFrame({
'A': ['baz', 'qux'],
'B': [3, 4]
})

In [7]:
df_conc = pd.concat([df1, df2])
df_conc

     A  B
0  foo  1
1  bar  2
0  baz  3
1  qux  4

In [10]:
df1 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K2'],
'chiave2': ['K0', 'K1', 'K0'],
'A': ['A0', 'A1', 'A2']
})

df2 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K3'],
'chiave2': ['K0', 'K0', 'K0'],
'B': ['B0', 'B1', 'B3']
})

In [12]:
df1
df2

  chiave1 chiave2   B
0      K0      K0  B0
1      K1      K0  B1
2      K3      K0  B3

In [9]:
df_merged = pd.merge(df1, df2, on=['chiave1', 'chiave2'], how='left')
df_merged

  chiave1 chiave2   A    B
0      K0      K0  A0   B0
1      K1      K1  A1  NaN
2      K2      K0  A2  NaN

In [13]:
df1 = pd.DataFrame({
'A': ['A0', 'A1', 'A2'],
'B': ['B0', 'B1', 'B2']
}, index=[0, 1, 2])

df2 = pd.DataFrame({
'C': ['C0', 'C1', 'C2'],
'D': ['D0', 'D1', 'D2']
}, index=[0, 2, 3])

df1
df2

    C   D
0  C0  D0
2  C1  D1
3  C2  D2

In [14]:
df_conc = pd.concat([df1, df2], axis=1)
df_conc

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1  NaN  NaN
2   A2   B2   C1   D1
3  NaN  NaN   C2   D2

In [16]:
df1 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3']
})

df2 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2'],
'B': ['B0', 'B1', 'B2']
})

df3 = pd.DataFrame({
'chiave': ['K1', 'K2', 'K4'],
'C': ['C1', 'C2', 'C4']
})


print(df1, df2, df3)

  chiave   A
0     K0  A0
1     K1  A1
2     K2  A2
3     K3  A3   chiave   B
0     K0  B0
1     K1  B1
2     K2  B2   chiave   C
0     K1  C1
1     K2  C2
2     K4  C4

In [17]:
df_inner = pd.merge(df1, df2, on='chiave', how='inner')
df_inner

  chiave   A   B
0     K0  A0  B0
1     K1  A1  B1
2     K2  A2  B2

In [18]:
df_all = pd.merge(df_inner, df3, on='chiave', how='right')

In [19]:
df_all

  chiave    A    B   C
0     K1   A1   B1  C1
1     K2   A2   B2  C2
2     K4  NaN  NaN  C4

In [20]:
data = {
'Data': ['2024-01', '2024-01', '2024-02', '2024-02'],
'Categoria': ['A', 'B', 'A', 'B'],
'Valore': [10, 20, 15, 25]
}

df = pd.DataFrame(data)
df

      Data Categoria  Valore
0  2024-01         A      10
1  2024-01         B      20
2  2024-02         A      15
3  2024-02         B      25

In [21]:
df_pivot = df.pivot(index='Data', columns='Categoria', values='Valore')
df_pivot

Categoria   A   B
Data
2024-01    10  20
2024-02    15  25

In [22]:
data = {
'Venditore': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
'Mese': ['Gennaio', 'Gennaio', 'Febbraio', 'Febbraio', 'Gennaio'],
'Vendite': [200, 150, 300, 250, 100]
}

df = pd.DataFrame(data)
df

  Venditore      Mese  Vendite
0     Alice   Gennaio      200
1       Bob   Gennaio      150
2     Alice  Febbraio      300
3       Bob  Febbraio      250
4   Charlie   Gennaio      100

In [24]:
pivot_table = df.pivot_table(index='Venditore', columns='Mese', values='Vendite', aggfunc='sum')
pivot_table

Mese       Febbraio  Gennaio
Venditore
Alice         300.0    200.0
Bob           250.0    150.0
Charlie         NaN    100.0

In [1]:
#Parte 2 Esercizi

In [6]:
data = {
'Regione': ['Nord', 'Sud', 'Nord', 'Est', 'Ovest', 'Sud', 'Est', 'Ovest'],
'Prodotto': ['A', 'A', 'B', 'B', 'A', 'B', 'A', 'B'],
'Vendite': [100, 150, 200, 250, 300, 350, 400, 450]
}

df = pd.DataFrame(data)
df

  Regione Prodotto  Vendite
0    Nord        A      100
1     Sud        A      150
2    Nord        B      200
3     Est        B      250
4   Ovest        A      300
5     Sud        B      350
6     Est        A      400
7   Ovest        B      450

In [21]:
def range_vendite(dataframe):
    return dataframe.groupby(['Regione', 'Prodotto'])['Vendite'].var()

In [24]:
varianza_vendite= range_vendite(df)
print(varianza_vendite)

Regione  Prodotto
Est      A          NaN
         B          NaN
Nord     A          NaN
         B          NaN
Ovest    A          NaN
         B          NaN
Sud      A          NaN
         B          NaN
Name: Vendite, dtype: float64

In [25]:
pivot_table = df.pivot_table(
    index='Regione',
    columns='Prodotto',
    values='Vendite',
    aggfunc='var'
)
print(pivot_table)

Empty DataFrame
Columns: []
Index: []